/*********************************************************************************************************************
/*********************************************************************************************************************
* STC32G144K Opensourec Library ¼´£¨STC32G144K ¿ªÔ´¿â£©ÊÇÒ»¸ö»ùÓÚ¹Ù·½ SDK ½Ó¿ÚµÄµÚÈý·½¿ªÔ´¿â
* Copyright (c) 2025 SEEKFREE Öð·É¿Æ¼¼
*
* ±¾ÎÄ¼þÊÇSTC32G144K¿ªÔ´¿âµÄÒ»²¿·Ö
*
* STC32G144K ¿ªÔ´¿â ÊÇÃâ·ÑÈí¼þ
* Äú¿ÉÒÔ¸ù¾Ý×ÔÓÉÈí¼þ»ù½ð»á·¢²¼µÄ GPL£¨GNU General Public License£¬¼´ GNUÍ¨ÓÃ¹«¹²Ðí¿ÉÖ¤£©µÄÌõ¿î
* ¼´ GPL µÄµÚ3°æ£¨¼´ GPL3.0£©»ò£¨ÄúÑ¡ÔñµÄ£©ÈÎºÎºóÀ´µÄ°æ±¾£¬ÖØÐÂ·¢²¼ºÍ/»òÐÞ¸ÄËü
*
* ±¾¿ªÔ´¿âµÄ·¢²¼ÊÇÏ£ÍûËüÄÜ·¢»Ó×÷ÓÃ£¬µ«²¢Î´¶ÔÆä×÷ÈÎºÎµÄ±£Ö¤
* ÉõÖÁÃ»ÓÐÒþº¬µÄÊÊÏúÐÔ»òÊÊºÏÌØ¶¨ÓÃÍ¾µÄ±£Ö¤
* ¸ü¶àÏ¸½ÚÇë²Î¼û GPL
*
* ÄúÓ¦¸ÃÔÚÊÕµ½±¾¿ªÔ´¿âµÄÍ¬Ê±ÊÕµ½Ò»·Ý GPL µÄ¸±±¾
* Èç¹ûÃ»ÓÐ£¬Çë²ÎÔÄ<https://www.gnu.org/licenses/>
*
* ¶îÍâ×¢Ã÷£º
* ±¾¿ªÔ´¿âÊ¹ÓÃ GPL3.0 ¿ªÔ´Ðí¿ÉÖ¤Ð­Òé ÒÔÉÏÐí¿ÉÉêÃ÷ÎªÒëÎÄ°æ±¾
* Ðí¿ÉÉêÃ÷Ó¢ÎÄ°æÔÚ libraries/doc ÎÄ¼þ¼ÐÏÂµÄ GPL3_permission_statement.txt ÎÄ¼þÖÐ
* Ðí¿ÉÖ¤¸±±¾ÔÚ libraries ÎÄ¼þ¼ÐÏÂ ¼´¸ÃÎÄ¼þ¼ÐÏÂµÄ LICENSE ÎÄ¼þ
* »¶Ó­¸÷Î»Ê¹ÓÃ²¢´«²¥±¾³ÌÐò µ«ÐÞ¸ÄÄÚÈÝÊ±±ØÐë±£ÁôÖð·É¿Æ¼¼µÄ°æÈ¨ÉùÃ÷£¨¼´±¾ÉùÃ÷£©
*
* ÎÄ¼þÃû³Æ          
* ¹«Ë¾Ãû³Æ          ³É¶¼Öð·É¿Æ¼¼ÓÐÏÞ¹«Ë¾
* °æ±¾ÐÅÏ¢          ²é¿´ libraries/doc ÎÄ¼þ¼ÐÄÚ version ÎÄ¼þ °æ±¾ËµÃ÷
* ¿ª·¢»·¾³          MDK FOR C251
* ÊÊÓÃÆ½Ì¨          STC32G144K
* µêÆÌÁ´½Ó          https://seekfree.taobao.com/
*
* ÐÞ¸Ä¼ÇÂ¼
* ÈÕÆÚ              ×÷Õß           ±¸×¢
* 2025-11-20        ´óW            first version
********************************************************************************************************************/

#include "file_h_all.h"

// *************************** Àý³ÌÓ²¼þÁ¬½ÓËµÃ÷ ***************************
// ½ÓÈë¶æ»ú Ö÷°åÉÏ¶ÔÓ¦ÓÐ¶æ»úµÄ½Ó¿Ú Îñ±Ø×¢Òâ²»Òª²å·´ <ºìÉ«µçÔ´> <ºÚÉ«ÐÅºÅ> <»ÆÉ«/³ÈÉ«/×ØÉ«/°×É«...ÆäËü²ÊÉ«µÄÄÇ¸ùÊÇÐÅºÅ>
//      Ä£¿é¹Ü½Å            µ¥Æ¬»ú¹Ü½Å
//      PWM1                A0
//      PWM2                A2
//      PWM3                A4
//      PWM4                A6
//      GND                 ¶æ»úµçÔ´ GND ÁªÍ¨ ºËÐÄ°åµçÔ´µØ GND
//      VCC                 ¶æ»úµçÔ´Êä³ö


// *************************** Àý³Ì²âÊÔËµÃ÷ ***************************
// 1.ºËÐÄ°åÉÕÂ¼Íê³É±¾Àý³Ì
//
// 2.ÔÚ¶ÏµçÇé¿öÏÂ Íê³ÉºËÐÄ°å²åµ½Ö÷°åµÄºËÐÄ°å²å×ùÉÏ È·ÈÏºËÐÄ°åÓëÖ÷°å²å×ùÃ»ÓÐÃ÷ÏÔ·ìÏ¶
//
// 3.È»ºó½«¶æ»úÓëÖ÷°åÕýÈ·Á¬½Ó ÇëÎñ±Ø×¢Òâ²»Òª²å·´ È»ºóÊ¹ÓÃµç³Ø¸øÖ÷°å¹©µç´ò¿ª¿ª¹Ø
//
// 4.Õý³£Çé¿öÏÂ¶æ»ú»áÀ´»Ø×ª¶¯ ×îºÃÔÚ¶æ»úÃ»ÓÐ×°ÔÚ³µÉÏ¹Ì¶¨Á¬½Ó×ªÏòÁ¬¸ËÊ±²âÊÔ ·ÀÖ¹°²×°Î»ÖÃ²»¶ÔÔì³É¶Â×ªÉÕ¶æ»ú
//
// Èç¹û·¢ÏÖÏÖÏóÓëËµÃ÷ÑÏÖØ²»·û Çë²ÎÕÕ±¾ÎÄ¼þ×îÏÂ·½ Àý³Ì³£¼ûÎÊÌâËµÃ÷ ½øÐÐÅÅ²é


// **************************** ´úÂëÇøÓò ****************************
#define CHANNEL_NUMBER          (4)
#define SERVO_PWM1              (PWME_CH1P_PA0)                         // ¶¨ÒåÖ÷°åÉÏ¶æ»ú¶ÔÓ¦Òý½Å
#define SERVO_PWM2              (PWME_CH2P_PA2)                         // ¶¨ÒåÖ÷°åÉÏ¶æ»ú¶ÔÓ¦Òý½Å
#define SERVO_PWM3              (PWME_CH3P_PA4)                         // ¶¨ÒåÖ÷°åÉÏ¶æ»ú¶ÔÓ¦Òý½Å
#define SERVO_PWM4              (PWME_CH4P_PA6)                         //舵机引脚

#define SERVO_FREQ              (200 )                                           // ¶¨ÒåÖ÷°åÉÏ¶æ»úÆµÂÊ  ÇëÎñ±Ø×¢Òâ·¶Î§ 50-300

#define SERVO_L_MAX             (80 )                                           // ¶¨ÒåÖ÷°åÉÏ¶æ»ú»î¶¯·¶Î§ ½Ç¶È
#define SERVO_R_MAX             (100)                                           // ¶¨ÒåÖ÷°åÉÏ¶æ»ú»î¶¯·¶Î§ ½Ç¶È

// ------------------ ¶æ»úÕ¼¿Õ±È¼ÆËã·½Ê½ ------------------
//
// ¶æ»ú¶ÔÓ¦µÄ 0-180 »î¶¯½Ç¶È¶ÔÓ¦ ¿ØÖÆÂö³åµÄ 0.5ms-2.5ms ¸ßµçÆ½
//
// ÄÇÃ´²»Í¬ÆµÂÊÏÂµÄÕ¼¿Õ±È¼ÆËã·½Ê½¾ÍÊÇ
// PWM_DUTY_MAX/(1000/freq)*(1+Angle/180) ÔÚ 50hz Ê±¾ÍÊÇ PWM_DUTY_MAX/(1000/50)*(1+Angle/180)
//
// ÄÇÃ´ 100hz ÏÂ 90¶ÈµÄ´ò½Ç ¼´¸ßµçÆ½Ê±¼ä1.5ms ¼ÆËãÌ×ÓÃÎª
// PWM_DUTY_MAX/(1000/100)*(1+90/180) = PWM_DUTY_MAX/10*1.5
//
// ------------------ ¶æ»úÕ¼¿Õ±È¼ÆËã·½Ê½ ------------------
//#define SERVO_DUTY(x)         ((float)PWM_DUTY_MAX / (1000.0 / (float)SERVO_FREQ) * (0.5 + (float)(x) / 90.0))

#if ((SERVO_FREQ < 50) || (SERVO_FREQ > 300))
    #error "SERVO_MOTOR_FREQ ERROE!"
#endif


int16 servo_motor_duty = 2950;     ///中值                                             


void servo_init(void)
{
     pwm_init(SERVO_PWM1, SERVO_FREQ, 0);  // PA0
     pwm_init(SERVO_PWM2, SERVO_FREQ, 0);  // PA2
     pwm_init(SERVO_PWM3, SERVO_FREQ, 0);  // PA4
     pwm_init(SERVO_PWM4, SERVO_FREQ, 0);  // PA6

}

void servo_control(servo_motor_duty)
{
	 pwm_set_duty(SERVO_PWM1, servo_motor_duty);
   pwm_set_duty(SERVO_PWM2, servo_motor_duty);
   pwm_set_duty(SERVO_PWM3, servo_motor_duty);
   pwm_set_duty(SERVO_PWM4, servo_motor_duty);
}

